stress-test.yml
config:
  target: "http://ec2-3-140-254-7.us-east-2.compute.amazonaws.com:4006/Reviews"
  phases:
    - duration: 1
      arrivalRate: 1000
  payload:
    path: "reviews.csv"
    fields:
      - "productId"
scenarios:
  - name: "Get Reviews"
    flow:
      - get:
          url: "/getReviews/{{ productId }}"